#include <iostream>
using namespace std;

int main(){
    int a=125; // int төрлийн a хувьсагчид 125 гэсэн утга өгсөн.
    int *p = &a; // а хувьсагчийн хаягийг p хаяган хувьсагчид утга болгон онооно.
    cout<<p<<endl; // p заагчийн санах ойд зааж байгаа а-ийн хаягийг хэвлэнэ
    cout<<*p<<endl; // p заагчийн санах ойд зааж байгаа а-ийн утгыг хэвлэнэ
    p++; /* хаяган төрлийг нэгээр нэмэгдүүлэхэд дараагийн тоог заах буюу заагчийн
            зааж буй төрлийн хэмжээгээр утга нь нэмэгдэнэ. */
    cout<<p<<endl; // int төрлийн хувьсагчийн хаяг 4 байтаар нэмэгдэнэ.
    cout<<*p<<endl; // p заагчийн санах ойд зааж байгаа нэмэгдүүлсэн утгыг хэвлэнэ
}