#include <iostream>
using namespace std;

int main(){

    int numbers[5]; // бүхэл тоон төрөлтэй 5 утга хадгалах хүснэгт үүсгэж байна.
    int * p; // бүхэл тоо заах хаяган хувьсагч зарлаж байна.
    p = numbers;  *p = 10; /* хаяган хувьсагч numbers хүснэгтийг зааж байна. Заагч
    нь мөн хүснэгтийн эхний элемэнтийн хаягийг заадаг. */
    p++;  *p = 20; /* заагчийн утга 1-р тооны хаягийг утга болгон авна. Заагч
    1-р тоог зааж байгаа учир 1-р тооны утгыг 20 болгож байна. */
    p = &numbers[2];  *p = 30; /*хүснэгтийн 2-р элементийн хаягийг p заагчид олгоод
    хаягаар нь дамжуулан 2-р элемэнтийн утгыг 30 болгосон. */
    p = numbers + 3;  *p = 40; /* numbers бол хүснэгтийн эхлэл хаяг үүнийг гурваар
    нэмэгдүүлснээр хүснэгтийн гуравдугаар элементийн хаягтай ижил утгатай болно.
    Тиймээс заагч гурвадугаар элемэнтийг зааж, утгыг нь 40 болгож байна. */
    p = numbers;  *(p+4) = 50; /* p хаяган хувьсагч нь хүснэгтийн эхлэл хаягийг авна.
    Хаягийн арифметик хэрэглэн 4-р элемэнтийг зааж numbers[4]-ийн утгыг 50 болгож
    байна. */
    for (int n=0; n<5; n++)
    cout << numbers[n] << ", "; //Хүснэгтийн утгуудыг хэвлэх үйлдэл хийнэ.
}
