#include <iostream>
using namespace std;

void swap(int &a, int &b){  /*Заалтан хувьсагч ашигласан хоёр хувьсагчийн утга солих функцээ зарлана*/
    int temp; /*Шинэ хувьсагч зарлана*/
    temp = a; /*а-ийн хаягийг хадгална*/
    a = b; /*а-ийн заалтан хувьсагчид b-ийн утгыг онооно*/
    b = temp; /*b-ийн утгад temp-д хадгалсан *а-ийн утгыг онооно.
    Ингэснээр хоёр хувьсагчийн утга солигдоно.*/
}

int main(){
    int a, b; /*Хоёр тооныхоо хувьсагчийг зарлаж санах ой нөөцлөнө*/
    cin >> a >> b; /*Гараас 2 тооныхоо утгыг уншиж нөөцөлсөн санах ойдоо утгуудаа онооно*/
    swap(a, b);/*Заалтан хувьсагч ашигласан функцээ дуудаж ажиллуулна*/
    cout << a << " " << b; /*Солигдсон утгуудыг хэвлэнэ*/
}

