const quotes = [{
    quote: `"Бурхан ч сэтгэлээс гардаг. Буг ч сэтгэлээс бүтдэг."`,
    writer: `– Данзанравжаа`
}, {
    quote: `"Монгол гэж цээжээ дэлдэхийн оронд ЯВ, ҮЗ, ХАР тэгээд та нар хэн болохоо ойлгоно."`,
    writer: `– Н.Жанцанноров`
}, {
    quote: `"Хол бодохгүй аваас ойр зовлон ирнэ."`,
    writer: `– Д.Нацагдорж`
}, {
    quote: `"Олонд гайтайг нь мэдвэл хаан байвч зайлуул. Олонд тустайг мэдвэл харц байвч өргөмжил."`,
    writer: `– Чингис хаан`
}, {
    quote: `"Би хамгийн гэдэг үгэнд дургүй. Хамгийн гэдэг цорын ганц зүйл хэзээ ч байхгүй."`,
    writer: `– С.Зоригт`
}, {
    quote: `"Тэнэг хүнийг таних хэцүү болжээ. Тэд ухаантай үг их цээжилдэг болж."`,
    writer: `– Л.Түдэв`
}, {
    quote: `"Явган хүнээс хоцорвол унаатай байгаад яанам... Явуулын үгэнд үнэмшвэл ухаан заяагаад яанам..."`,
    writer: `– Ш.Гүрбазар`
}, {
    quote: `"Ганцаардлыг ялах хамгийн сайн арга бол урлаг."`,
    writer: `– Зураач Ц.Ган-Эрдэнэ`
}, {
    quote: `"Чамайг юу жаргалтай болгож байна түүнийгээ л хий."`,
    writer: `- Д.Номин`
}, {
    quote: `"Чиний бие энэ хорвоод түр зуурхан ирээд буцна гэж бодон бусдын төлөө сайн, сайхан зүйл хийж яваарай."`,
    writer: `- О.Дашбалбар`
}, {
    quote: `"Хүний сэтгэлийг хөдөлгөх тун амархан ч, дотоод сэтгэлд нь нэвтрэх хэцүү. "`,
    writer:`Э.Уранчимэг`
}]





let btn = document.querySelector("#Qbtn");

let quote = document.querySelector(".quote");

let writer = document.querySelector(".writer");






btn.addEventListener("click", function() {
    let random = Math.floor(Math.random() * quotes.length);
    
    
    quote.innerHTML = quotes[random].quote;

    
    writer.innerHTML = quotes[random].writer;
})
