/*3. Тэгш өнцөгтийн талуудыг өгөхөд талбайг буцаадаг хэрэглэгчийн функц бич.*/
#include <iostream>
using namespace std;

int Tegsh_untsugt_talbai(int a, int b){ /*Хэрэглэгчийн функц нь буцах утгатай тул хувьсагчийн төрлөө зарлаж дурын нэрээ өгсөн. Хаалтад оруулах утгуудаа зарлаж өгсөн.*/
    int S; /*Буцаах утгын хувьсагчаа зарлана*/
    S=a*b; /*Авсан хувьсагчуудаа тооцоолон буцах хувьсагчиддаа хадгална*/

    return S; /*Хувьсагчаа буцаана.*/
}

int main(){
    int a, b; /*Гараас утга авах хувьсагчуудаа зарлана*/
    cout<<"Taluudaa oruulna uu: "; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    cin>>a>>b; /*Хувьсагчийн утгуудыг гараас уншиж авна*/
    cout<<"Talbai ni: "<<Tegsh_untsugt_talbai(a,b); /*Функцээ дуудаж хэвлэнэ*/
}

