/*4. Өгөгдсөн N хүртэлх тооны нийлбэр, арифметик дундажыг ол.*/
#include <iostream>
using namespace std;

int main(){
    int n, s=0; /*Хэрэглэгдэх хувьсагчуудаа зарлаж хэрэгтэй бол утга оноож өгнө*/
    cout<<"N toog oruulna uu: "; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    cin>>n; /*Хувьсагчийн утгуудыг гараас уншиж авна*/
    for(int i=1; i<=n; i++){ /*N хүртэлх бүх тоог авахын тулд 1-ээс N хүртэл явах давталт ашигласан*/
        s=s+i; /*Энэ үйлдлээр N хүртэлх бүх тоог нэмнэ*/
    }
    cout<<"N hurtelh niilber ni: "<<s<<endl; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    cout<<"Arifmetic dundaj ni: "<<s/n; /*Энэ үйлдлээр нэмэгдсэн тоогоо ширхэгийнх нь буюу n-дээ хувааж өгөн арифметик дунджийг хэвлэнэ.*/
}
