/*5. Гараас өгөгдсөн N ширхэг тооны нийлбэр, үржвэрийг ол.*/
#include <iostream>
using namespace std;

int main(){
    int n, s=0, w=1, a[100]; /*Хэрэглэгдэх хувьсагчуудаа зарлаж хэрэгтэй бол утга оноож өгнө*/
    cout<<"N toog oruulna uu: "; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    cin>>n; /*Хувьсагчийн утгуудыг гараас уншиж авна*/
    cout<<"N shirheg random too oruulna uu: "; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    for(int i=1; i<=n; i++){ /*Хүснэгтэд олон утгууд хадгалах тул давталт ашигласан*/
        cin>>a[i]; /*Хувьсагчийн утгуудыг гараас уншиж авна*/
    }
    for(int i=1; i<=n; i++){
        s=s+a[i]; /* S Хувьсагчид хүснэгтийн нийлбэр утгуудыг хадгална*/
        w=w*a[i]; /* W Хувьсагчид хүснэгтийн үржвэр утгуудыг хадгална*/
    }
    cout<<"N hurtelh niilber ni: "<<s<<endl; /*Нийлбэр утгыг хэвлэнэ*/
    cout<<"N hurtelh urjver ni: "<<w; /*Үржүүлсэн утгыг хэвлэнэ*/
}
