/*8. Өгөгдсөн хүснэгтийн арифметик дунджийг олдог хэрэглэгчийн функц бич.*/
#include <iostream>
using namespace std;

int Arifmetic_dundaj(int a[],int n){/*Хэрэглэгчийн функц нь буцах утгатай тул хувьсагчийн төрлөө зарлаж дурын нэрээ өгсөн. Хаалтад оруулах утгуудаа зарлаж өгсөн.*/
    int l, s=0; /*Хэрэглэгдэх хувьсагчуудаа зарлаж хэрэгтэй бол утга оноож өгнө*/
    for(int i=0;i<n;i++){ /*Бүх утгыг нэмэгдүүлэх тул N хүртэл давталт гүйлгэнэ*/
        s+=a[i]; /*Нэг хувьсагчид нийлбэр утгуудыг хадгална*/
    }
    l=s/n; /*Арифметик дунджийг олох*/
    return l; /*Олдсон хариугаа буцаана*/
}
int main(){
    int n, a[100]; /*Хэрэглэгдэх хувьсагчуудаа зарлаж хэрэгтэй бол утга оноож өгнө*/
    float avg; /*Хэрэглэгдэх хувьсагчуудаа зарлаж хэрэгтэй бол утга оноож өгнө*/
    cout<<"N toog oruulna uu: "; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    cin>>n; /*Хувьсагчийн утгуудыг гараас уншиж авна*/
    cout<<"N shirheg random too oruulna uu: "; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    for(int i=0; i<n; i++){ /*Хүснэгтэд олон утгууд хадгалах тул давталт ашигласан*/
        cin>>a[i]; /*Хувьсагчийн утгуудыг гараас уншиж авна*/
    }
    avg=Arifmetic_dundaj(a, n); /*Функцээ дуудаж хувьсагчид хадгална*/
    cout<<"Arifmetic dundaj ni: "<< avg; /*Сүүлчийн хариу утгыг хэвлэнэ*/
}