/*9. Хүснэгтийг өсөх/буурахаар эрэмбэл.*/
#include <iostream>
using namespace std;

int main(){
    int n, a[100]; /*Хэрэглэгдэх хувьсагчуудаа зарлаж хэрэгтэй бол утга оноож өгнө*/
    cout<<"N toog oruulna uu: "; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    cin>>n; /*Хувьсагчийн утгуудыг гараас уншиж авна*/
    cout<<"N shirheg random too oruulna uu: "; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/
    for(int i=0; i<n; i++){/*Хүснэгтэд олон утгууд хадгалах тул давталт ашигласан*/
        cin>>a[i]; /*Хувьсагчийн утгуудыг гараас уншиж авна*/
    }
    for(int i=0; i<n-1;i++){ /*Bubble sort ашиглаж хөршүүдийг нь хооронд нь жишнэ*/
        int temp = 0;
        for(int j=0; j<n-i-1;j++){
            if(a[j]>=a[j+1]){/*Хэрэв ард байгаа элемент нь бага бол доорх үйлдлээр байраа солино */
                temp=a[j];
                a[j]=a[j+1];
                a[j+1]=temp;
            }
        }
    }
    cout<<"Usuhuur erembelegdsen baidal"<<endl; /*Ойлгомжтой байлгах үүднээс дэлгэцэд заавар хэвлэн харуулна*/ 
    for(int i=0; i<n; i++){
        cout<<a[i]<<" "; /*Эрэмбэлэгдсэн хувьсагчийн утгуудыг хэвлэнэ*/
    }

}